// // - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// function squre(a,b) {
//     let result= a*b;
//     console.log(result);
// }
//
// squre(10,20);
//


// - створити функцію яка обчислює та повертає площу кола з радіусом r

// function squre(p,r) {
//     let result= p*r*r;
//     console.log(result);
// }
//
// squre(Math.PI,3);
//

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r (2πrh)
// function squre(p,r,h) {
//     let result= 2*(p*r*h);
//     console.log(result);
// }
//
// squre(Math.PI,3,2);

// - створити функцію яка приймає масив та виводить кожен його елемент

// function mass(arr) {
//     for (const item of arr) {
//         console.log(item);
//     }
// }
// mass([1,2,3,4,5])

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

//
// function parag(par,text) {
//  document.write(`<p>${text}</p>`)
// }
//
// parag('h2','привіт')
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// function ligku(par,text) {
//     document.write(`<li>${text}</li>
//                     <li>${text}</li>
//                     <li>${text}</li>`)
// }
//
// ligku('h2','привіт куку')
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
    // Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)- НЕ ЗНАЮ ЯК ЦЕ ЗРОБИТИ
// function ulki(par,text) {
//     document.write(`<ul>${text}</ul>
//                     <ul>${text}</ul>
//                     <ul>${text}</ul>`)
// }
//
// ulki('h2','привіт куку')


// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// function gqq(q,...date) {
// console.log(date);
// }
//
// gqq('uuuuu','наповнюю','масив',96,true);
// // console.log(arr)


// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масивe
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13